/*Создай Kotlin файл Datatypes в пакете домашней работы и вставь в него все эти строки.

Для каждой переменной добавь тип через двоеточие.

Если в строке обнаружишь ошибку в синтаксисе - закомментируй эту строку и над ней напиши что с ней не так.*/

val v1: Int = 42
val v2: Long = 98765432123456789L
val v3: Float = 23.45f
val v4: Double = 0.123456789
val v5: String = "Kotlin & Java"
// Значение должно быть написано строчными буквами
//val v6 = FALSE
val v7: Char = 'c'
val v8: Short = 500
val v9: Long = 4294967296L
val v10: Float = 18.0f
val v11: Double = -0.001
val v12: String = "OpenAI"
val v13: String = "true"
val v14: List<Byte> = listOf(3, 14)
val v15: Char = '9'
val v16: Short = 2048
val v17: Long = 10000000000L
val v18: Set<String> = setOf("OpenAI", "Quantum Computing")
val v19: Float = 5.75f
// Значение должно быть с прямыми кавычками или без их
//val v20 = `1.414`
val v21: String = "Artificial Intelligence"
val v22: Array<Any> = arrayOf('x', "A")
val v23: String = "Android Studio"
val v24: Char = 'A'
val v25: Short = 1024
val v26: Long = 1234567890123L
val v27: Float = 10.01f
val v28: Double = -273.15
val v29: String = "SpaceX"
// Значение должно быть написано строчными буквами
// val v30 = FALSE
val v31: Double = 0.007
// Использованы обычные кавычки вместо обычных
//val v32 = “🤯”
val v33: Map<String, Byte> = mapOf("true" to 2, "false" to 34)
// Использованы неверные кaвычки
//val v34 = ‘65535’
val v35: Long = 72057594037927935L
val v36: Float = 2.71828f
val v37: Double = 101.0101
val v38: String = "Quantum Computing"
val v39: Map<Int, String> = mapOf(2 to "true", 34 to "false")
val v40: Char = 'x'
val v41: Short = 314
val v42: Long = 123456789123456789L
val v43: Float = 6.626f
//Значение должно быть написано строчными буквами
//val v44 = TRUE


/*Подбери подходящий тип который будет:

Хранить букву, на которую указывает палец медиума во время спиритического сеанса. - Char
Хранить количество ложек сахара, которые я кладу в одну чашку чая. - Byte
Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле. - Lost<Double>
Хранить длину очереди в столовой до миллиардной доли сантиметра. - Double
Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу. - Boolean
Хранить количество свистков чайника за день. - Byte
Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы. - Short
Хранить количество попыток пересчитать звёзды на небе за всю историю человечества. - Long
Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма. - Float
Хранить словарь «название стартапа → сумму потерь инвесторов». - Map<String, Double>
Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов. - String
Хранить список тем для митингов, которые на самом деле никому не нужны. - List<String>*/