package org.example.lessons.lesson12.homework

fun main() {
//    Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод, не повторяйся.
//    Методы для приведения коллекции к значению:
//    isNotEmpty
//    getOrElse
//    joinToString
//    firstOrNull
//    size
//    isEmpty
//    minOrNull
//    contains
//    sum
//    average
//    maxOrNull
    val numbers = listOf(1, 5, 7, 8, 2, 3, 4, 6, 0, 9)
    val emptyList = emptyList<Int>()
//Задачи на приведение коллекции к значению
//1. Проверить, что размер коллекции больше 5 элементов.
    println(numbers.size > 5)
//2. Проверить, что коллекция пустая
    println(emptyList.isEmpty())
//3. Проверить, что коллекция не пустая
    println(numbers.isNotEmpty())
//4. Взять элемент по индексу или создать значение если индекса не существует
    println(numbers.getOrElse(10) {15})
//5. Собрать коллекцию в строку
    println(numbers.joinToString(separator = ", "))
//6. Посчитать сумму всех значений
    println(numbers.sum())
//7. Посчитать среднее
    println(numbers.average())
//8. Взять максимальное число
    println(numbers.maxOrNull())
//9.Взять минимальное число
    println(numbers.minOrNull())
//10. Взять первое число или null
    println(numbers.firstOrNull())
//11. Проверить что коллекция содержит элемент
    println(numbers.contains(1))


//    Методы для обработки данных в коллекции
//    sorted
//    groupBy
//    distinct
//    take
//    takeLast
//    filter
//    filterNot
//    map
//    associate
//    sortedDescending
//    forEach
//    filterNotNull
//Задачи на обработку коллекций
//12. Отфильтровать коллекцию по диапазону 18-30
    val coll1 = listOf<Int>(29, 36, 3, 4, 5, 18, 7, 8, 89, 154)
    println(coll1.filter { it in 18..30 })
//13. Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(coll1.filterNot { it % 2  == 0 && it % 3 == 0})
//14. Очистить текстовую коллекцию от null элементов
    val coll2 = listOf("1234", "12435", null, "124354656")
    println(coll2.filterNotNull())
//15. Преобразовать текстовую коллекцию в коллекцию длин слов
    val coll3 = listOf("belarus", "russia", "germany", "poland", "ukraine", "USA", "poland")
    println(coll3.map { it.length  })
//16. Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    println(coll3.associate { it.reversed() to it.length })
//17. Отсортировать список в алфавитном порядке
    println(coll3.sorted())
//18. Взять первые 3 элемента списка
    println(coll3.sorted().take(3))
//19. Распечатать квадраты элементов списка
    coll1.forEach { println(it * it) }
//20. Группировать список по первой букве слов
    println(coll3.groupBy { it.first() })
//21. Очистить список от дублей
    println(coll3.distinct())
//22. Отсортировать список по убыванию
    println(coll1.sortedDescending())
//23. Взять последние 3 элемента списка
    println(coll1.takeLast(3))

//
//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
//
fun describeCollection(numbers: List<Int>): String {
    return when {
        numbers.isEmpty() -> "Пусто"                                   //Если коллекция пустая - “Пусто”
        numbers.size < 5 -> "Короткая"                                 //Если количество элементов меньше пяти - “Короткая”
        numbers.first() == 0 -> "Стартовая"                            //Если коллекция начинается с 0 - “Стартовая”
        numbers.sum() > 10000 -> "Массивная"                           //Если сумма всех чисел больше 10000 - “Массивная”
        numbers.average() == 10.0 -> "Сбалансированная"                //Если среднее значение равно 10 - “Сбалансированная”
        numbers.joinToString("").length == 20 -> "Клейкая"  //Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
        (numbers.maxOrNull() ?: 0) < -10 -> "Отрицательная"            //Если максимальное число меньше -10 - “Отрицательная”
        (numbers.minOrNull() ?: 0) > 1000 -> "Положительная"           //Если минимальное число больше 1000 - “Положительная”
        numbers.contains(3) && numbers.contains(14) -> "Пи***тая"      //Если содержит одновременно числа 3 и 14 - “Пи***тая”
        else -> "Уникальная"                                           //Иначе - “Уникальная”
    }
}

        println(describeCollection(emptyList()))                                   // Пусто
        println(describeCollection(listOf(1, 2, 3)))                               // Короткая
        println(describeCollection(listOf(0, 1, 2, 3, 4)))                         // Стартовая
        println(describeCollection(listOf(3000, 3000, 3000, 3000, 1)))             // Массивная
        println(describeCollection(listOf(10, 10, 10, 10, 10)))                    // Сбалансированная
        println(describeCollection(listOf(1234, 1234, 1234, 1234, 1234)))          // Клейкая
        println(describeCollection(listOf(-20, -30, -40, -50, -60)))               // Отрицательная
        println(describeCollection(listOf(1001, 1002, 1003, 1004, 1005, 1006)))    // Положительная
        println(describeCollection(listOf(3, 14, 100, 200, 300)))                  // Пи***тая
        println(describeCollection(listOf(1, 2, 100, 200, 300)))                   // Уникальная


//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//Цель: Отфильтровать удовлетворительные оценки (>=60),
// отсортировать оставшиеся по возрастанию и взять первые 3.
// Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
fun collGrades(grades: List<Int>): List<Int> {
    return grades
        .filter { it >= 60 }   // 1. Отфильтровать удовлетворительные оценки (>=60)
        .sorted()              // 2. отсортировать оставшиеся по возрастанию
        .take(3)           // 3. взять первые 3
}

        val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
        println(collGrades(grades))

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
    val list = listOf(
    "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф",
    "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло",
    "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы",
    "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
fun catalog(items: List<String>): Map<Char, List<String>> = items.map { it.lowercase() }.groupBy { it.first() }

        val goodCatalog = catalog(list)
        goodCatalog.forEach { (letter, words) ->
            println("$letter: $words")
        }


//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный текст с двумя знаками после запятой,
//используя функцию format и подходящий шаблон.
fun averageWordLength(items: List<String>): String {
    val avg = items
        .map { it.length }                                    // 1. перевели все слова в количество букв
        .average()                                            // 2. подсчитали среднее значение

    return "Средняя длина слова: %.2f".format(avg)    // 3. отформатировали с 2 знаками
}
    println(averageWordLength(list))


//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
    val numbers1 = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
fun coll4Numbers(numbers1: List<Int>): Map<String, List<Int>> {
    return numbers1
        .distinct()                  // 1. убрали дубли
        .sortedDescending()          // 2. отсортировали по убыванию
        .groupBy {                   // 3. сгруппировали по чётности
            if (it % 2 == 0) "четные" else "нечетные"
        }
}
    println(coll4Numbers(numbers1))

//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Начальные значения:
    val ages = listOf(22, 18, 30, 45, 17, null, 60) //и число для проверки возраста, например 18.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.
fun findFirst(ages: List<Int?>, ages2: Int): Int? {
    return ages
        .filterNotNull()                    // 1. убираем null-элементы
        .firstOrNull { it > ages2 }         // 2. ищем первый подходящий или null
}
    println(findFirst(ages, 18))
    println(findFirst(ages, 30))
    println(findFirst(ages, 60))
    println(findFirst(ages, 100))
}